{
     "school": [
          {
              "name": "University of Washington",
              "degree": "Computer Science and Software Engineer, Minor Mathematics, B.S.",
              "graduation": "2014 - 2017",
              "area": "Bothell, WA",
              "logo": "image/Logo_UW.png",
              "site": "https://washington.edu",
              "course": ["Technical Writing for Computing Professionals", "Programming Issues with Object-Oriented Languages (C++)", "Data Structures, Algorithms, and Discrete Mathematics I (C++)", "Data Structures, Algorithms, and Discrete Mathematics II (C++)", "Management Principles", "Software Engineering", "Analysis and Design", "Hardware and Computer Organization", "Operating Systems", "3-D Computer Graphic", "Database Systems", "Bioinformatics", "Computer Vision", "K-12 Computing Education", "Fundamentals of Web Media Technology", "Fundamentals of Modern Mathematics", "Matrix Algebra", "Multivariable Calculus"],
              "honor": ["Dean's List, Winter 2015 - Fall 2016"]
          }, 
          {
                "name": "North Seattle College",
                "degree": "Computer Science, A.S.",
                "graduation": "2011 - 2014",
                "area": "Seattle, WA",
                "logo": "image/Logo_NSCC.png",
                "site": "https://northseattle.edu",
                "course": ["Introduction to Computer Programming (Python)", "Computer Programming I (Java)", "Computer Programming II (Java)", "Computer Art (ART210)", "Calculus I", "Calculus II", "Calculus III", "Differential Equations", "Engineering Physic I", "Engineering Physic II"],
                "honor": ["President's List, Winter 2012 - Spring 2014", "Education Fund Scholarship, Fall 2013 - Spring 2014"]
          },
          {
                "name": "Horwang School",
                "degree": "Art and Japanese, Highschool Diploma",
                "graduation": "2007 - 2009",
                "area": "Bangkok, Thailand",
                "logo": "image/Logo_HW.jpg",
                "site": "http://www.horwang.ac.th/",
                "course": [],
               "honor": []
          }
     ],
     
     "job":[
          {
               "name": "North Seattle",
               "title": "Computer Science and Mathematics Tutor",
               "time": "April 2015 - Present",
               "area": "Seattle, WA",
               "logo": "image/Logo_NSCC.png",
               "site": "http://webshare.northseattle.edu/MLC/",
               "description": "Assist students 1:1 with concepts and assignment according to individual strengths, and as well offer assistance with developing study strategies and techniques. Lastly, represent the institution in collaborating with e-tutoring, online tutoring platform.",
               "skill": ["Java", "Python", "C++", "C#", "HTML", "CSS", "javaScript", "Algebra", "Pre-Calculus", "Calculus"]
          },
          {
               "name": "University of Washington",
               "title": "Undergraduate Reserach Assistant",
               "time": "March 2016 - December 2016",
               "area": "Bothell, WA",
               "logo": "image/Logo_UW.png",
               "site": "https://depts.washington.edu/cmmr/GTCS/",
               "description": "Work on creation of a functional API for a tower defense game, Hug the Line, to use in teaching beginner-level coding concepts. In addition, write and refine lesson plan materials to support over 30 hours of instruction to teach java programming using the functional API to middle school aged students.<br><br> In Summer 2016, I was the representative of the University of Washington to work with Pacific Science Center as a Tech/Programming Teacher for the Java Coding and Video Games Summer Camp 2016. I taught approximately 40 middle school students using the material developed by myself and my team.",
               "skill": ["Java", "GIT", "Word Processor"]
          },
          {
               "name": "University of Washington",
               "title": "Undergraduate Reserach Assistant",
               "time": "January 2016 - December 2016",
               "area": "Bothell, WA",
               "logo": "image/Logo_UW.png",
               "site": "https://washington.edu",
               "description": "Reserach and study the efficient strategy in finding protein network motifs, and as well implement a network motif detection software using c++ and python integrating with SQL. Detection of network motifs is computationally expensive, and speeding up the process using database engines will improve its usability in biology.",
               "skill": ["Python", "C++", "SQL", "Git"]
          },
          {
               "name": "University of Washington",
               "title": "Undergraduate Reserach Assistant",
               "time": "January 2015 - Present",
               "area": "Bothell, WA",
               "logo": "image/Logo_UW.png",
               "site": "http://faculty.washington.edu/geetha/research.html",
               "description": "Work with a research group that focuses Mobile Health Application to develop an iPhone health application that analyzes users’ stress level. Research and study best practices with Objective-C, the security aspect of mobile application, and also the UX/UI design for health application smartphone and PDAs.",
               "skill": ["Objective-C", "GIT"]
          },
          {
               "name": "University of Washington",
               "title": "Teaching Assistant",
               "time": "September 2015 - December 2015",
               "area": "Bothell, WA",
               "logo": "image/Logo_UW.png",
               "site": "https://washington.edu",
               "description": "Performed duties and tasks that are instructed by the Professor. Mainly, responsibled in evaluating and grade assignments, quizzes, examinations, and record grades. But, also assisted the Professor in designing the course, preparing materials for the class, and also observing the class’s understanding of the course material according to their performance in the assignments.",
               "skill": ["SQL"]
          },
          {
               "name": "Papaya Clothing",
               "title": "Sale Associate",
               "time": "April 2015 - September 2015",
               "area": "Seattle, WA",
               "logo": "image/Logo_PAPAYA.png",
               "site": "https://www.papayaclothing.com",
               "description": "Assisted customers with questions and concerns about products. Handled sales transactions courteously and professionally, including operating cash registers and handling all exchanges and returns. Sustained a neat, clean, organized, safe, and friendly shopping environment. Supervised and trained new employees",
               "skill": []
          },
          {
               "name": "MBK Center",
               "title": "Event Staff",
               "time": "December 2008 - July 2010",
               "area": "Bangkok, Thailand",
               "logo": "image/Logo_MBK.png",
               "site": "www.mbk-center.co.th/",
               "description": "Utilized a thorough knowledge of building policies, procedures and event requirements. Provided access control, crowd management and ensure the venue is safe for guests. Provided guests with accurate event and venue information. Acted upon all comments/complaints in a prompt and friendly manner. Ensured a safe and fun environment for all guests, staff and performers. Assisted in other duties as assigned",
               "skill": []
          }
     ],
     "work": [
          {
               "name": "Are You A Potato Drawer?",
               "image": "image/Work_AreYouAPotatoDrawer.png",
               "site": "https://github.com/kunlakan/Are-You-A-Potato-Drawer",
               "description": "is a program/game that recognizes shapes drawn by the user by using computer vision techniques. I served as a lead developer designing and implementing the shape detector element that detects 8 different geometric shapes and 3 basic shapes (such as heart, starts, and thunderbolts).",
               "skill": ["C++", "OpenCV"]
          }, 
         {
               "name": "Crow Invaders",
               "image": "image/Word_CrowInvaders.jpg",
               "site": "https://docs.google.com/document/d/13w97YHEIYnr6R1KlIY3UkyJRd6FQ1nad1mHw2slVApI/",
               "description": "is a recreation of Space Invadres with the University of Washington, Bothell, theme developed by a team of students. I served as analyst and architect who was responsible for designing necessary architectures for the project such as wireframes, use case diagrams/descriptions, activity diagrams, data flow diagrams, robustness diagrams, and etc.",
               "skill": ["Word Processor", "Photoshop", "draw.io"]
          }, 
          {
               "name": "Farm House",
               "image": "image/Work_FramSim.png",
               "site": "https://github.com/kunlakan/Farm-House",
               "description": "is a 3D world and simulation that I and a few friends created for a bit of fun. The theme was a modern house in a farmland, inspired by <a href='http://www.inouesatoru.jp/221/' target='_blank'>雲海に浮かぶ箱舟</a>. I was responsible for 3D modeling the house, animating and creating features of the house, and as well implementing gaming control.",
               "skill": ["C#", "Unity", "SketchUp", "Photoshop"]
          }, 
          {
               "name": "Disassembler",
               "image": "image/Work_Disassembler.png",
               "site": "https://github.com/kunlakan/Disassembler",
               "description": "is a program that translates machine language into assembly language. I served as a developer who designed and developed 30 instructions decoders, the project leader for team by developing project plans, scheduling regular team meetings, and monitoring progress along with tracking task-completion, and a tester by created test cases, tested the software, and constantly updated testing reports.",
               "skill": ["68000 Assembly Language", "EASy68K"]
          }, 
          {
               "name": "UW IAS",
               "image": "image/Work_HealthApp.png",
               "site": "",
               "description": "is an iPhone health application that analyzes users’ stress level. Worked with a research team that focuses on Mobile Health Application. I was responsible for doing a research about UX/UI for health application smartphone and PDAs, and as well studying objective-c programming language in order to implement the interface for the application.",
               "skill": ["Objective-C"]
          }, 
          {
               "name": "BigTree Resort Official Website",
               "image": "image/Work_BigTree.png",
               "site": "",
               "description": "is an official website for BigTree Resort, which is owned by my family in Kamphaeng Phet, Thailand. I alone designed and implemented the site to display all important necessary information about the resort and as well online room reservation service that send reservation information directly to the hotel receptionist through e-mail.",
               "skill": ["HTML", "CSS", "javaScript", "PHP", "Photoshop"]
          },
          {
               "name": "HPBE+",
               "image": "image/Work_hpbpositive.png",
               "site": "",
               "description": "is a fan forum dedicated Hello! Project members, but not limited to other Japanese bands and groups in any music genre. It is a place for fans to share news and talk about their favorite idols. I was one of the administrators who responsible for designing, implementing, and maintaining the interface of the forum.",
               "skill": ["HTML", "CSS", "javaScript", "PHP", "Photoshop", "Branding"]
          }
     ],
     "about": {
          "picture": "image/Me.jpg",
          "head": "I'm a Software Developer from Seattle, WA, with a passion for design.",
          "description": "I am passionate in developing softwares or tools that make lives of others better and giving them a deeper connection to technology. When I am not coding, I love to ice skate, dance, and eat a lot of chocolate ♥<br>",
          "linkedin": "https://www.linkedin.com/in/kunlakan",
          "resume": "media/Resume.pdf",
          "email": "kunlakan (at) uw.edu"
     }
}